Repository: MostafaM117/car_maintenance_app
Catalog: lib/l10n/intl_*.arb
Languages: ar

# welcome
source: Welcome to CarPal
ar: مرحباً بك في كاربال

# welcome_seller
source: Welcome Back ,Seller
ar: مرحباً بك

# welcomedis
source: Your all-in-one solution for car maintenance and spare parts
ar: حل متكامل لصيانة السيارات وقطع الغيار

# get_started
source: Let’s get started
ar: ابدأ الآن

# get_starteddis
source: Whether you're a car owner looking to stay on top of maintenance, or a seller offering trusted parts, we've got you covered.
ar: سواء كنت مالك سيارة وترغب في متابعة الصيانة، أو بائعًا يقدم قطع غيار موثوقة، فلدينا ما يلبي احتياجاتك

# car_owner
source: I'm a Car Owner
ar: أنا مالك سيارة

# parts_seller
source: I'm a Parts Seller
ar: أنا بائع قطع غيار

source: Sign In
ar: تسجيل الدخول

# Sign_carPal
source: Sign in to CarPal
ar: تسجيل الدخول الي كاربال

# Sigup_carPal
source: Sign up to CarPal
ar: إنشاء حساب في كاربال

# Donot_account
source: Don’t have an account?
ar: ليس لديك حساب

# welcome_back
source: Welcome back! Please enter your details!
ar: مرحباً بك، يُرجى إدخال بياناتك

source: or
ar: أو

# user_name
source: Enter your Username
ar: اسم المستخدم

# with_Google
source: Continue with Google
ar: متابعة مع جوجل

source: Sign Up
ar: إنشاء حساب

# email
source: Enter your email
ar: أدخل بريدك الإلكتروني

# emailS
source: Enter your business email
ar: أدخل بريدك الإلكتروني الخاص بالعمل

# enter_national_id
source: Enter your national id number
ar: أدخل رقم القومي

# password
source: Enter your password
ar: أدخل كلمة المرور

# forgot_password
source: Forgot Password? Reset it
ar: هل نسيت كلمة المرور؟ إعادة التعيين

# congratulations
source: Your account is ready to use!
ar: تم إنشاء حسابك بنجاح!

# add_car_details
source: Now you can add your car details to get started.
ar: الآن يمكنك إضافة تفاصيل سيارتك للبدء.

source: Submit
ar: إرسال

source: Dismiss
ar: تجاهل

# mileage
source: Mileage (KM)
ar: عدد الكيلومترات (كم)

source: Car Year
ar: سنة الصنع

source: Car Model
ar: طراز السيارة

source: Car Make
ar: نوع السيارة

source: Next Maintenance
ar: الصيانة القادمة

# welcome_home
source: Welcome Back, {name}!
ar: مرحبًا بعودتك، {name}

# support_text
source: Tap here and we’ll help you out!
ar: اضغط هنا وسنساعدك!

source: Explore
ar: استكشف

# no_maintenance_records
source: No maintenance records available.
ar: لا توجد سجلات صيانة متاحة.

# no_upcoming_maintenance
source: No upcoming maintenance needed.
ar: لا توجد صيانة قادمة مطلوبة.

# please_add_car_to_see_maintenance
source: Please add a car to see maintenance items
ar: يرجى إضافة سيارة لعرض عناصر الصيانة

source: Notifications
ar: الإشعارات

# no_notifications
source: No notifications at the moment
ar: لا توجد إشعارات حالياً

source: Add maintenance
ar: إضافة صيانة

source: Delete Maintenance
ar: حذف الصيانة

source: Chat Bot
ar: المساعد الذكي

source: Market
ar: المتجر

source: Search
ar: بحث

source: Offers
ar: العروض

source: Account
ar: الحساب

source: My Cars
ar: سياراتي

source: Add New Car
ar: إضافة سيارة جديدة

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Log Out
ar: تسجيل الخروج

# create_business_account
source: Create your business account now
ar: أنشئ حساب نشاطك التجاري الآن

# enter_business_name
source: Enter your business name
ar: أدخل اسم النشاط التجاري

# confirm_password
source: Confirm your password
ar: تأكيد كلمة المرور

# already_have_account
source: Already have an account?
ar: هل لديك حساب بالفعل؟

# error_enter_businessname
source: Please enter a businessname
ar: يرجى إدخال اسم النشاط التجاري

# error_enter_national_id
source: Please enter your national id
ar: يرجى إدخال رقم الهوية الوطنية

# error_invalid_national_id
source: Please enter a valid national id
ar: يرجى إدخال رقم هوية وطنية صحيح

# error_enter_email
source: An email address is required
ar: البريد الإلكتروني مطلوب

# error_invalid_email
source: Please enter a valid email address
ar: يرجى إدخال بريد إلكتروني صحيح

# error_enter_password
source: Please enter a password to sign up
ar: يرجى إدخال كلمة مرور لإنشاء الحساب

# error_short_password
source: Your password should be at least 6 characters
ar: يجب أن تكون كلمة المرور على الأقل 6 أحرف

# error_passwords_not_match
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# please_enter_username
source: Please enter a username
ar: من فضلك أدخل اسم المستخدم

# registered_successfully
source: Registered Successfully, Complete Your First time setup
ar: تم التسجيل بنجاح، أكمل إعداداتك لأول مرة

# email_already_registered
source: This email is already registered
ar: هذا البريد الإلكتروني مسجل بالفعل

# error_generic
source: Error:
ar: خطأ:

# agree_terms_text
source: By signing up, you agree to our
ar: بالتسجيل، فإنك توافق على

# terms_and_privacy
source: Terms of Service and Privacy Policy.
ar: شروط الاستخدام وسياسة الخصوصية.

# check_terms_warning
source: Check terms to continue
ar: يرجى الموافقة على الشروط للمتابعة

# title
source: Complete your business account details
ar: أكمل بيانات حسابك التجاري

# tax_number
source: Enter your tax registration number
ar: أدخل رقم التسجيل الضريبي

# phone_number
source: Enter your business phone number
ar: أدخل رقم هاتف النشاط التجاري

# location
source: Get your current location
ar: احصل على موقعك الحالي

# upload_images
source: Upload Your Images
ar: قم برفع صور بطاقتك

# finish_signup
source: Finish Signing up
ar: إكمال التسجيل

# error_tax_empty
source: Please enter your tax registration number
ar: يرجى إدخال رقم التسجيل الضريبي

# error_tax_invalid
source: Please enter a valid tax registration number
ar: يرجى إدخال رقم ضريبي صحيح

# error_phone_empty
source: Please enter your phone number
ar: يرجى إدخال رقم الهاتف

# error_phone_invalid
source: Please a valid phone number
ar: يرجى إدخال رقم هاتف صحيح

# error_location
source: Please enter your location
ar: يرجى إدخال موقعك

# error_id_images
source: Please upload the front and back sides of your national ID
ar: يرجى رفع صور البطاقة الأمامية والخلفية

# error_more_than_two
source: You can't upload more than 2 images
ar: لا يمكنك رفع أكثر من صورتين

# error_select_two
source: Please select the front and back sides of your national ID
ar: يرجى تحديد صورتي البطاقة الأمامية والخلفية

# error_terms
source: Terms of Service must be checked
ar: يجب الموافقة على شروط الخدمة

# error_general
source: Error
ar: حدث خطأ

source: All Upcoming Maintenance
ar: جميع صيانة السيارات القادمة

# add_maintenanceh
source: ADD Maintenance
ar: إضافة صيانة

source: ASK CHAT BOT
ar: اسأل شات بوت

source: CHECKOUT OFFERS
ar: تصفح العروض

source: View All
ar: عرض الكل

# no_cars_found
source: No cars found. Add a car to see it here.
ar: لم يتم العثور على سيارات. أضف سيارة لتظهر هنا.

# confirm_delete_car
source: Are you sure you want to delete your car?
ar: هل أنت متأكد أنك تريد حذف سيارتك؟

# delete_warning
source: This action is permanent and cannot be undone. All your data will be permanently removed.
ar: هذا الإجراء دائم ولا يمكن التراجع عنه. سيتم حذف جميع بياناتك بشكل نهائي.

source: Car deleted successfully
ar: تم حذف السيارة بنجاح

source: Average monthly usage (KM)
ar: متوسط الاستخدام الشهري (كم)

source: Average (KM)
ar: المتوسط (كم)

source: Please enter average usage
ar: يرجى إدخال متوسط الاستخدام

# current_car_mileage
source: Current car mileage (Approx.)
ar: عداد السيارة الحالي (تقريباً)

# mileage_hint
source: Mileage (KM)
ar: المسافة (كم)

source: Please enter mileage
ar: يرجى إدخال المسافة

source: Used
ar: مستعمل

source: Home
ar: الرئيسية

source: Maintain
ar: الصيانة

source: Maintenance
ar: الصيانة

source: Terms & Conditions
ar: الشروط والأحكام

source: Profile
ar: الملف الشخصي

source: Language
ar: اللغة

source: Maintenance Details
ar: تفاصيل الصيانة

source: Maintenance Type
ar: نوع الصيانة

source: Current mileage
ar: عدد الكيلومترات الحالي

source: Expected Date
ar: التاريخ المتوقع

source: Maintenance Status
ar: حالة الصيانة

source: Description
ar: الوصف

source: Back
ar: رجوع

source: Skip
ar: تخطي

# tutorialHome
source: This is the home page
ar: هنا الصفحة الرئيسية

# tutorialMaintain
source: This is maintenance
ar: هنا الصيانة

# tutorialChatbot
source: This is the chatbot
ar: هنا الدردشة مع الذكاء الاصطناعي

# tutorialMarket
source: This is the market
ar: هنا المتجر

# tutorialProfile
source: This is your profile
ar: هنا الملف الشخصي

# greeting
source: Hi
ar: مرحبًا

# defaultUsername
source: User
ar: المستخدم

# instruction
source: Please fill in your car details to continue.
ar: يرجى إدخال تفاصيل سيارتك للمتابعة.

source: Car Model
ar: طراز السيارة

source: Model Year
ar: سنة الصنع

# mileageLabel
source: Current car mileage (Approx.)
ar: عدد الكيلومترات الحالي (تقريبًا)

# mileageHint
source: Mileage (KM)
ar: المسافة المقطوعة (كم)

# mileageError
source: Please enter mileage
ar: يرجى إدخال عدد الكيلومترات

# averageUsageLabel
source: Average monthly usage (KM)
ar: متوسط الاستخدام الشهري (كم)

# averageUsageHint
source: Average (KM)
ar: المتوسط (كم)

# averageUsageError
source: Please enter average usage
ar: يرجى إدخال المتوسط الشهري

# lastMaintenance
source: Last periodic Maintenance
ar: آخر صيانة دورية

source: Select Maintenance Date
ar: اختر تاريخ الصيانة

# permanentDeleteTitle
source: Are you sure you want to delete this item?
ar: هل أنت متأكد أنك تريد حذف هذا العنصر؟

# permanentDeleteMessage
source: This action is permanent and cannot be undone.
ar: هذا الإجراء دائم ولا يمكن التراجع عنه.

source: Product Name
ar: اسم المنتج

source: Add Product Name
ar: أضف اسم المنتج

source: Product Category
ar: فئة المنتج

source: Availability
ar: التوفر

source: Stock Count
ar: الكمية بالمخزون

source: Add Count
ar: أضف الكمية

source: Price
ar: السعر

source: Add Price
ar: أضف السعر

source: Discard
ar: إلغاء

source: Add
ar: إضافة

source: Done
ar: تم

# addCarToViewMaintenance
source: Please add a car to see maintenance items
ar: يرجى إضافة سيارة لعرض عناصر الصيانة

source: undo
ar: تراجع

# termsTitle
source: Terms and Conditions
ar: الشروط والأحكام

# termsIntro
source: Please read these Terms and Conditions carefully before using the app. By accessing or using the Application, you agree to be bound by these Terms. If you do not agree with any part of the Terms, you must not use the Application.
ar: يرجى قراءة هذه الشروط والأحكام بعناية قبل استخدام التطبيق. من خلال الوصول إلى التطبيق أو استخدامه، فإنك توافق على الالتزام بهذه الشروط. إذا كنت لا توافق على أي جزء من هذه الشروط، فيجب عليك عدم استخدام التطبيق.

# section1Title
source: 1. Service Description
ar: 1. وصف الخدمة

# section1Body
source: The Application provides tools for tracking and managing vehicle maintenance, including but not limited to reminders for periodic services, repair log entries, and informational guidance based on user-input data and vehicle-specific maintenance schedules.
ar: يوفر التطبيق أدوات لتتبع وصيانة المركبات، بما في ذلك، على سبيل المثال لا الحصر، التذكيرات بمواعيد الصيانة الدورية، تسجيل سجلات الإصلاح، وتقديم إرشادات معلوماتية استنادًا إلى البيانات المدخلة من قبل المستخدم وجداول الصيانة الخاصة بكل مركبة.

# section2Title
source: 2. Disclaimer
ar: 2. إخلاء مسؤولية

# section2Body
source: • The Application is intended for informational and assistance purposes only. It is not a substitute for professional vehicle inspections or certified maintenance services. • We make no warranties regarding the completeness, accuracy, or reliability of the data, and accept no liability for damages or breakdowns resulting from reliance on the Application’s content. • Information accuracy depends in part on user input, and actual results may vary accordingly.
ar: ● يُعد التطبيق أداة معلوماتية ومساعدة فقط، ولا يُعد بديلاً عن فحص السيارة من قبل المتخصصين أو مراكز الصيانة المعتمدة. ● لا نقدم أي ضمانات بشأن اكتمال أو دقة أو موثوقية البيانات المعروضة، ولا نتحمل أي مسؤولية عن أي أضرار أو أعطال قد تنتج عن الاعتماد على محتوى التطبيق. ● تعتمد دقة المعلومات جزئيًا على البيانات المدخلة من قبل المستخدم، وقد تختلف النتائج من حالة إلى أخرى.

# section3Title
source: 3. Third-Party Parts and Services
ar: 3. قطع الغيار والطرف الثالث

# section3Body
source: • The Application may act as an intermediary between users and third-party parts suppliers. We do not guarantee the quality, authenticity, or suitability of any parts or services offered. • Any transaction conducted outside the Application is strictly between the user and the third party. We disclaim all responsibility for any issues arising from such interactions. • We do not warrant the availability or pricing accuracy of listed products.
ar: ● قد يعمل التطبيق كوسيط بين المستخدمين وموردي قطع الغيار من الأطراف الثالثة. لا نضمن جودة أو صحة أو ملاءمة أي قطع أو خدمات يتم عرضها. ● أي تعامل يتم خارج نطاق التطبيق يقع ضمن مسؤولية المستخدم والطرف الثالث فقط، ولا نتحمل أي مسؤولية ناتجة عن تلك التعاملات. ● لا نضمن توافر المنتجات أو دقة الأسعار المدرجة في جميع الأوقات.

# section4Title
source: 4. Data Usage and Privacy
ar: 4. استخدام البيانات والخصوصية

# section4Body
source: • We reserve the right to use aggregated, anonymized user data to improve service quality and analyze usage patterns. • User data will be stored securely and not shared with third parties without prior user consent, except as required by law.
ar: ● نحتفظ بالحق في استخدام البيانات المجملة والمجهولة الهوية لتحسين جودة الخدمة وتحليل أنماط الاستخدام. ● سيتم تخزين بيانات المستخدم بأمان، ولن تتم مشاركتها مع أي طرف ثالث دون موافقة مسبقة من المستخدم، باستثناء الحالات التي يتطلبها القانون.

# section5Title
source: 5. Amendments to Terms
ar: 5. تعديل الشروط

# section5Body
source: We reserve the right to modify these Terms at any time. Material changes will be communicated through the Application or via email. Continued use of the Application after such changes constitutes your acceptance of the updated Terms.
ar: نحتفظ بالحق في تعديل هذه الشروط في أي وقت. وسيتم إخطار المستخدمين بأي تغييرات جوهرية من خلال التطبيق أو عبر البريد الإلكتروني. ويُعد استمرارك في استخدام التطبيق بعد هذه التعديلات بمثابة موافقة ضمنية على الشروط المعدّلة.

# section6Title
source: 6. User Accounts
ar: 6. حسابات المستخدمين

# section6Body
source: • You agree to provide accurate, current, and complete information when creating or updating your account. • You are solely responsible for maintaining the confidentiality of your login credentials and for all activities occurring under your account. • We reserve the right to suspend or terminate accounts that violate these Terms or contain false or misleading information.
ar: ● يلتزم المستخدم بإدخال معلومات دقيقة وحديثة عند إنشاء الحساب أو تحديثه. ● يتحمل المستخدم وحده مسؤولية الحفاظ على سرية بيانات تسجيل الدخول، وكافة الأنشطة التي تتم من خلال الحساب تقع تحت مسؤوليته. ● نحتفظ بالحق في تعليق أو إنهاء الحسابات التي تنتهك هذه الشروط أو تحتوي على معلومات كاذبة أو مضللة.

# section7Title
source: 7. User-Submitted Content
ar: 7. المحتوى المُدخل من قبل المستخدم

# section7Body
source: • You are solely responsible for the accuracy of data you submit, including mileage, vehicle information, and repair logs. • We reserve the right to edit or remove content that violates our policies or is deemed harmful, misleading, or inappropriate.
ar: ● يتحمل المستخدم المسؤولية الكاملة عن دقة وصحة البيانات التي يُدخلها، مثل: عدد الكيلومترات، معلومات السيارة، وسجلات الإصلاح. ● نحتفظ بالحق في تعديل أو حذف أي محتوى ينتهك سياسات الاستخدام أو يحتوي على معلومات مضللة أو ضارة.

# section8Title
source: 8. Maintenance Reminders and Notifications
ar: 8. إشعارات وتذكيرات الصيانة

# section8Body
source: • The Application provides automated notifications based on user-entered data. We do not guarantee the accuracy or timeliness of such notifications. • Users are encouraged to regularly inspect their vehicles and not rely solely on the Application for maintenance alerts.
ar: ● يعتمد التطبيق على إشعارات تلقائية تستند إلى البيانات المدخلة من قبل المستخدم. لا نضمن دقة أو توقيت هذه الإشعارات. ● يُنصح المستخدم بمراجعة حالة مركبته بانتظام وعدم الاعتماد الكامل على تنبيهات التطبيق.

# section9Title
source: 9. Prohibited Use
ar: 9. الاستخدام غير المشروع

# section9Body
source: You agree not to: • Use the Application for any unlawful, abusive, or fraudulent purposes; • Infringe upon the rights of others or violate intellectual property laws; • Attempt unauthorized access to the Application or associated systems. We reserve the right to suspend or permanently delete user accounts engaged in prohibited activities.
ar: ● يوافق المستخدم على عدم: • استخدام التطبيق لأي أغراض غير قانونية أو مسيئة أو احتيالية؛ • انتهاك حقوق الآخرين أو قوانين حماية الملكية الفكرية؛ • محاولة الوصول غير المصرح به إلى التطبيق أو أنظمته المرتبطة. نحتفظ بالحق في تعليق أو حذف الحسابات التي يتم استخدامها بشكل ينتهك هذه الشروط.

# section10Title
source: 10. Limitation of Liability
ar: 10. تحديد المسؤولية

# section10Body
source: To the fullest extent permitted by applicable law, we shall not be liable for any indirect, incidental, special, consequential, or punitive damages arising out of or related to your use of or inability to use the Application.
ar: إلى أقصى حد يسمح به القانون المعمول به، لا نتحمل أي مسؤولية عن الأضرار غير المباشرة أو العرضية أو الخاصة أو التبعية أو العقابية الناتجة عن استخدامك أو عدم قدرتك على استخدام التطبيق.

# section11Title
source: 11. Governing Law
ar: 11. القانون الحاكم

# section11Body
source: These Terms shall be governed by and construed in accordance with the laws of Egypt.
ar: تخضع هذه الشروط وتُفسر وفقًا لقوانين جمهورية مصر العربية. وتكون محاكم مصر المختصة هي صاحبة الولاية القضائية الحصرية في أي نزاع ينشأ بموجب هذه الشروط.

# section12Title
source: 12. Severability
ar: 12. القابلية للفصل

# section12Body
source: If any provision of these Terms is found to be invalid or unenforceable under applicable law, such provision shall be modified to the minimum extent necessary to make it valid, and the remaining provisions shall remain in full force and effect.
ar: إذا تبين أن أي بند من هذه الشروط غير صالح أو غير قابل للتنفيذ بموجب القانون المعمول به، فسيتم تعديل هذا البند بالقدر اللازم ليصبح صالحًا، وتظل باقي البنود سارية بكامل قوتها وأثرها.

source: Contact Us
ar: للتواصل معنا

# contactUsBody
source: If you have any questions about these Terms, please contact us at: carapp711@gmail.com.
ar: إذا كانت لديك أي استفسارات بخصوص هذه الشروط، يرجى التواصل معنا عبر البريد الإلكتروني: carapp711@gmail.com
